Zakrzewiaczek/stm32-asm-interpreter/Drivers/Registers/Src/stm32l476xx_registers.c
/**
 * @warning This file is auto-generated by `generate_registers_map.py` script. Do not edit manually.
 * @file    stm32l476xx_registers.c
 * @author  Jakub Zakrzewski
 * @brief   STM32L476xx hardware register mapping (implementation)
 * @date    2026-03-09
 *
 * @copyright Copyright (c) 2026
 */

#include <string.h>
#include <stdlib.h>
#include <stdbool.h>
#include "stm32l476xx.h"
#include "stm32l476xx_registers.h"

#define REG_ENTRY(name, reg) {name, (void *)&(reg), sizeof(reg)}

static bool hwregs_sorted = false;

static int cmp_register(const void *a, const void *b)
{
    return strcmp(((const register_t *)a)->name, ((const register_t *)b)->name);
}

void registers_init(void)
{
    qsort(hwregs, REGISTERS_COUNT, sizeof(register_t), cmp_register);
    hwregs_sorted = true;
}

register_t *get_register(const char *name)
{
    if (!name)
        return NULL;

    if (hwregs_sorted)
    {
        register_t key = {.name = name};
        return (register_t *)bsearch(&key, hwregs, REGISTERS_COUNT, sizeof(register_t), cmp_register);
    }

    // Fallback: linear search (before init)
    for (size_t i = 0; i < REGISTERS_COUNT; i++)
    {
        if (strcmp(hwregs[i].name, name) == 0)
        {
            return &hwregs[i];
        }
    }
    return NULL;
}

register_t hwregs[REGISTERS_COUNT] = {

    // ADC registers
    REG_ENTRY("ADC1_ISR", ADC1->ISR),
    REG_ENTRY("ADC1_IER", ADC1->IER),
    REG_ENTRY("ADC1_CR", ADC1->CR),
    REG_ENTRY("ADC1_CFGR", ADC1->CFGR),
    REG_ENTRY("ADC1_CFGR2", ADC1->CFGR2),
    REG_ENTRY("ADC1_SMPR1", ADC1->SMPR1),
    REG_ENTRY("ADC1_SMPR2", ADC1->SMPR2),
    REG_ENTRY("ADC1_TR1", ADC1->TR1),
    REG_ENTRY("ADC1_TR2", ADC1->TR2),
    REG_ENTRY("ADC1_TR3", ADC1->TR3),
    REG_ENTRY("ADC1_SQR1", ADC1->SQR1),
    REG_ENTRY("ADC1_SQR2", ADC1->SQR2),
    REG_ENTRY("ADC1_SQR3", ADC1->SQR3),
    REG_ENTRY("ADC1_SQR4", ADC1->SQR4),
    REG_ENTRY("ADC1_DR", ADC1->DR),
    REG_ENTRY("ADC1_JSQR", ADC1->JSQR),
    REG_ENTRY("ADC1_OFR1", ADC1->OFR1),
    REG_ENTRY("ADC1_OFR2", ADC1->OFR2),
    REG_ENTRY("ADC1_OFR3", ADC1->OFR3),
    REG_ENTRY("ADC1_OFR4", ADC1->OFR4),
    REG_ENTRY("ADC1_JDR1", ADC1->JDR1),
    REG_ENTRY("ADC1_JDR2", ADC1->JDR2),
    REG_ENTRY("ADC1_JDR3", ADC1->JDR3),
    REG_ENTRY("ADC1_JDR4", ADC1->JDR4),
    REG_ENTRY("ADC1_AWD2CR", ADC1->AWD2CR),
    REG_ENTRY("ADC1_AWD3CR", ADC1->AWD3CR),
    REG_ENTRY("ADC1_DIFSEL", ADC1->DIFSEL),
    REG_ENTRY("ADC1_CALFACT", ADC1->CALFACT),
    REG_ENTRY("ADC2_ISR", ADC2->ISR),
    REG_ENTRY("ADC2_IER", ADC2->IER),
    REG_ENTRY("ADC2_CR", ADC2->CR),
    REG_ENTRY("ADC2_CFGR", ADC2->CFGR),
    REG_ENTRY("ADC2_CFGR2", ADC2->CFGR2),
    REG_ENTRY("ADC2_SMPR1", ADC2->SMPR1),
    REG_ENTRY("ADC2_SMPR2", ADC2->SMPR2),
    REG_ENTRY("ADC2_TR1", ADC2->TR1),
    REG_ENTRY("ADC2_TR2", ADC2->TR2),
    REG_ENTRY("ADC2_TR3", ADC2->TR3),
    REG_ENTRY("ADC2_SQR1", ADC2->SQR1),
    REG_ENTRY("ADC2_SQR2", ADC2->SQR2),
    REG_ENTRY("ADC2_SQR3", ADC2->SQR3),
    REG_ENTRY("ADC2_SQR4", ADC2->SQR4),
    REG_ENTRY("ADC2_DR", ADC2->DR),
    REG_ENTRY("ADC2_JSQR", ADC2->JSQR),
    REG_ENTRY("ADC2_OFR1", ADC2->OFR1),
    REG_ENTRY("ADC2_OFR2", ADC2->OFR2),
    REG_ENTRY("ADC2_OFR3", ADC2->OFR3),
    REG_ENTRY("ADC2_OFR4", ADC2->OFR4),
    REG_ENTRY("ADC2_JDR1", ADC2->JDR1),
    REG_ENTRY("ADC2_JDR2", ADC2->JDR2),
    REG_ENTRY("ADC2_JDR3", ADC2->JDR3),
    REG_ENTRY("ADC2_JDR4", ADC2->JDR4),
    REG_ENTRY("ADC2_AWD2CR", ADC2->AWD2CR),
    REG_ENTRY("ADC2_AWD3CR", ADC2->AWD3CR),
    REG_ENTRY("ADC2_DIFSEL", ADC2->DIFSEL),
    REG_ENTRY("ADC2_CALFACT", ADC2->CALFACT),
    REG_ENTRY("ADC3_ISR", ADC3->ISR),
    REG_ENTRY("ADC3_IER", ADC3->IER),
    REG_ENTRY("ADC3_CR", ADC3->CR),
    REG_ENTRY("ADC3_CFGR", ADC3->CFGR),
    REG_ENTRY("ADC3_CFGR2", ADC3->CFGR2),
    REG_ENTRY("ADC3_SMPR1", ADC3->SMPR1),
    REG_ENTRY("ADC3_SMPR2", ADC3->SMPR2),
    REG_ENTRY("ADC3_TR1", ADC3->TR1),
    REG_ENTRY("ADC3_TR2", ADC3->TR2),
    REG_ENTRY("ADC3_TR3", ADC3->TR3),
    REG_ENTRY("ADC3_SQR1", ADC3->SQR1),
    REG_ENTRY("ADC3_SQR2", ADC3->SQR2),
    REG_ENTRY("ADC3_SQR3", ADC3->SQR3),
    REG_ENTRY("ADC3_SQR4", ADC3->SQR4),
    REG_ENTRY("ADC3_DR", ADC3->DR),
    REG_ENTRY("ADC3_JSQR", ADC3->JSQR),
    REG_ENTRY("ADC3_OFR1", ADC3->OFR1),
    REG_ENTRY("ADC3_OFR2", ADC3->OFR2),
    REG_ENTRY("ADC3_OFR3", ADC3->OFR3),
    REG_ENTRY("ADC3_OFR4", ADC3->OFR4),
    REG_ENTRY("ADC3_JDR1", ADC3->JDR1),
    REG_ENTRY("ADC3_JDR2", ADC3->JDR2),
    REG_ENTRY("ADC3_JDR3", ADC3->JDR3),
    REG_ENTRY("ADC3_JDR4", ADC3->JDR4),
    REG_ENTRY("ADC3_AWD2CR", ADC3->AWD2CR),
    REG_ENTRY("ADC3_AWD3CR", ADC3->AWD3CR),
    REG_ENTRY("ADC3_DIFSEL", ADC3->DIFSEL),
    REG_ENTRY("ADC3_CALFACT", ADC3->CALFACT),

    // ADC_Common registers
    REG_ENTRY("ADC123_COMMON_CSR", ADC123_COMMON->CSR),
    REG_ENTRY("ADC123_COMMON_CCR", ADC123_COMMON->CCR),
    REG_ENTRY("ADC123_COMMON_CDR", ADC123_COMMON->CDR),

    // CAN registers
    REG_ENTRY("CAN_MCR", CAN->MCR),
    REG_ENTRY("CAN_MSR", CAN->MSR),
    REG_ENTRY("CAN_TSR", CAN->TSR),
    REG_ENTRY("CAN_RF0R", CAN->RF0R),
    REG_ENTRY("CAN_RF1R", CAN->RF1R),
    REG_ENTRY("CAN_IER", CAN->IER),
    REG_ENTRY("CAN_ESR", CAN->ESR),
    REG_ENTRY("CAN_BTR", CAN->BTR),
    REG_ENTRY("CAN_FMR", CAN->FMR),
    REG_ENTRY("CAN_FM1R", CAN->FM1R),
    REG_ENTRY("CAN_FS1R", CAN->FS1R),
    REG_ENTRY("CAN_FFA1R", CAN->FFA1R),
    REG_ENTRY("CAN_FA1R", CAN->FA1R),
    REG_ENTRY("CAN1_MCR", CAN1->MCR),
    REG_ENTRY("CAN1_MSR", CAN1->MSR),
    REG_ENTRY("CAN1_TSR", CAN1->TSR),
    REG_ENTRY("CAN1_RF0R", CAN1->RF0R),
    REG_ENTRY("CAN1_RF1R", CAN1->RF1R),
    REG_ENTRY("CAN1_IER", CAN1->IER),
    REG_ENTRY("CAN1_ESR", CAN1->ESR),
    REG_ENTRY("CAN1_BTR", CAN1->BTR),
    REG_ENTRY("CAN1_FMR", CAN1->FMR),
    REG_ENTRY("CAN1_FM1R", CAN1->FM1R),
    REG_ENTRY("CAN1_FS1R", CAN1->FS1R),
    REG_ENTRY("CAN1_FFA1R", CAN1->FFA1R),
    REG_ENTRY("CAN1_FA1R", CAN1->FA1R),

    // COMP registers
    REG_ENTRY("COMP1_CSR", COMP1->CSR),
    REG_ENTRY("COMP2_CSR", COMP2->CSR),

    // COMP_Common registers
    REG_ENTRY("COMP12_COMMON_CSR", COMP12_COMMON->CSR),

    // CRC registers
    REG_ENTRY("CRC_DR", CRC->DR),
    REG_ENTRY("CRC_IDR", CRC->IDR),
    REG_ENTRY("CRC_CR", CRC->CR),
    REG_ENTRY("CRC_INIT", CRC->INIT),
    REG_ENTRY("CRC_POL", CRC->POL),

    // DAC registers
    REG_ENTRY("DAC_CR", DAC->CR),
    REG_ENTRY("DAC_SWTRIGR", DAC->SWTRIGR),
    REG_ENTRY("DAC_DHR12R1", DAC->DHR12R1),
    REG_ENTRY("DAC_DHR12L1", DAC->DHR12L1),
    REG_ENTRY("DAC_DHR8R1", DAC->DHR8R1),
    REG_ENTRY("DAC_DHR12R2", DAC->DHR12R2),
    REG_ENTRY("DAC_DHR12L2", DAC->DHR12L2),
    REG_ENTRY("DAC_DHR8R2", DAC->DHR8R2),
    REG_ENTRY("DAC_DHR12RD", DAC->DHR12RD),
    REG_ENTRY("DAC_DHR12LD", DAC->DHR12LD),
    REG_ENTRY("DAC_DHR8RD", DAC->DHR8RD),
    REG_ENTRY("DAC_DOR1", DAC->DOR1),
    REG_ENTRY("DAC_DOR2", DAC->DOR2),
    REG_ENTRY("DAC_SR", DAC->SR),
    REG_ENTRY("DAC_CCR", DAC->CCR),
    REG_ENTRY("DAC_MCR", DAC->MCR),
    REG_ENTRY("DAC_SHSR1", DAC->SHSR1),
    REG_ENTRY("DAC_SHSR2", DAC->SHSR2),
    REG_ENTRY("DAC_SHHR", DAC->SHHR),
    REG_ENTRY("DAC_SHRR", DAC->SHRR),
    REG_ENTRY("DAC1_CR", DAC1->CR),
    REG_ENTRY("DAC1_SWTRIGR", DAC1->SWTRIGR),
    REG_ENTRY("DAC1_DHR12R1", DAC1->DHR12R1),
    REG_ENTRY("DAC1_DHR12L1", DAC1->DHR12L1),
    REG_ENTRY("DAC1_DHR8R1", DAC1->DHR8R1),
    REG_ENTRY("DAC1_DHR12R2", DAC1->DHR12R2),
    REG_ENTRY("DAC1_DHR12L2", DAC1->DHR12L2),
    REG_ENTRY("DAC1_DHR8R2", DAC1->DHR8R2),
    REG_ENTRY("DAC1_DHR12RD", DAC1->DHR12RD),
    REG_ENTRY("DAC1_DHR12LD", DAC1->DHR12LD),
    REG_ENTRY("DAC1_DHR8RD", DAC1->DHR8RD),
    REG_ENTRY("DAC1_DOR1", DAC1->DOR1),
    REG_ENTRY("DAC1_DOR2", DAC1->DOR2),
    REG_ENTRY("DAC1_SR", DAC1->SR),
    REG_ENTRY("DAC1_CCR", DAC1->CCR),
    REG_ENTRY("DAC1_MCR", DAC1->MCR),
    REG_ENTRY("DAC1_SHSR1", DAC1->SHSR1),
    REG_ENTRY("DAC1_SHSR2", DAC1->SHSR2),
    REG_ENTRY("DAC1_SHHR", DAC1->SHHR),
    REG_ENTRY("DAC1_SHRR", DAC1->SHRR),

    // DFSDM_Filter registers
    REG_ENTRY("DFSDM1_Filter0_FLTCR1", DFSDM1_Filter0->FLTCR1),
    REG_ENTRY("DFSDM1_Filter0_FLTCR2", DFSDM1_Filter0->FLTCR2),
    REG_ENTRY("DFSDM1_Filter0_FLTISR", DFSDM1_Filter0->FLTISR),
    REG_ENTRY("DFSDM1_Filter0_FLTICR", DFSDM1_Filter0->FLTICR),
    REG_ENTRY("DFSDM1_Filter0_FLTJCHGR", DFSDM1_Filter0->FLTJCHGR),
    REG_ENTRY("DFSDM1_Filter0_FLTFCR", DFSDM1_Filter0->FLTFCR),
    REG_ENTRY("DFSDM1_Filter0_FLTJDATAR", DFSDM1_Filter0->FLTJDATAR),
    REG_ENTRY("DFSDM1_Filter0_FLTRDATAR", DFSDM1_Filter0->FLTRDATAR),
    REG_ENTRY("DFSDM1_Filter0_FLTAWHTR", DFSDM1_Filter0->FLTAWHTR),
    REG_ENTRY("DFSDM1_Filter0_FLTAWLTR", DFSDM1_Filter0->FLTAWLTR),
    REG_ENTRY("DFSDM1_Filter0_FLTAWSR", DFSDM1_Filter0->FLTAWSR),
    REG_ENTRY("DFSDM1_Filter0_FLTAWCFR", DFSDM1_Filter0->FLTAWCFR),
    REG_ENTRY("DFSDM1_Filter0_FLTEXMAX", DFSDM1_Filter0->FLTEXMAX),
    REG_ENTRY("DFSDM1_Filter0_FLTEXMIN", DFSDM1_Filter0->FLTEXMIN),
    REG_ENTRY("DFSDM1_Filter0_FLTCNVTIMR", DFSDM1_Filter0->FLTCNVTIMR),
    REG_ENTRY("DFSDM1_Filter1_FLTCR1", DFSDM1_Filter1->FLTCR1),
    REG_ENTRY("DFSDM1_Filter1_FLTCR2", DFSDM1_Filter1->FLTCR2),
    REG_ENTRY("DFSDM1_Filter1_FLTISR", DFSDM1_Filter1->FLTISR),
    REG_ENTRY("DFSDM1_Filter1_FLTICR", DFSDM1_Filter1->FLTICR),
    REG_ENTRY("DFSDM1_Filter1_FLTJCHGR", DFSDM1_Filter1->FLTJCHGR),
    REG_ENTRY("DFSDM1_Filter1_FLTFCR", DFSDM1_Filter1->FLTFCR),
    REG_ENTRY("DFSDM1_Filter1_FLTJDATAR", DFSDM1_Filter1->FLTJDATAR),
    REG_ENTRY("DFSDM1_Filter1_FLTRDATAR", DFSDM1_Filter1->FLTRDATAR),
    REG_ENTRY("DFSDM1_Filter1_FLTAWHTR", DFSDM1_Filter1->FLTAWHTR),
    REG_ENTRY("DFSDM1_Filter1_FLTAWLTR", DFSDM1_Filter1->FLTAWLTR),
    REG_ENTRY("DFSDM1_Filter1_FLTAWSR", DFSDM1_Filter1->FLTAWSR),
    REG_ENTRY("DFSDM1_Filter1_FLTAWCFR", DFSDM1_Filter1->FLTAWCFR),
    REG_ENTRY("DFSDM1_Filter1_FLTEXMAX", DFSDM1_Filter1->FLTEXMAX),
    REG_ENTRY("DFSDM1_Filter1_FLTEXMIN", DFSDM1_Filter1->FLTEXMIN),
    REG_ENTRY("DFSDM1_Filter1_FLTCNVTIMR", DFSDM1_Filter1->FLTCNVTIMR),
    REG_ENTRY("DFSDM1_Filter2_FLTCR1", DFSDM1_Filter2->FLTCR1),
    REG_ENTRY("DFSDM1_Filter2_FLTCR2", DFSDM1_Filter2->FLTCR2),
    REG_ENTRY("DFSDM1_Filter2_FLTISR", DFSDM1_Filter2->FLTISR),
    REG_ENTRY("DFSDM1_Filter2_FLTICR", DFSDM1_Filter2->FLTICR),
    REG_ENTRY("DFSDM1_Filter2_FLTJCHGR", DFSDM1_Filter2->FLTJCHGR),
    REG_ENTRY("DFSDM1_Filter2_FLTFCR", DFSDM1_Filter2->FLTFCR),
    REG_ENTRY("DFSDM1_Filter2_FLTJDATAR", DFSDM1_Filter2->FLTJDATAR),
    REG_ENTRY("DFSDM1_Filter2_FLTRDATAR", DFSDM1_Filter2->FLTRDATAR),
    REG_ENTRY("DFSDM1_Filter2_FLTAWHTR", DFSDM1_Filter2->FLTAWHTR),
    REG_ENTRY("DFSDM1_Filter2_FLTAWLTR", DFSDM1_Filter2->FLTAWLTR),
    REG_ENTRY("DFSDM1_Filter2_FLTAWSR", DFSDM1_Filter2->FLTAWSR),
    REG_ENTRY("DFSDM1_Filter2_FLTAWCFR", DFSDM1_Filter2->FLTAWCFR),
    REG_ENTRY("DFSDM1_Filter2_FLTEXMAX", DFSDM1_Filter2->FLTEXMAX),
    REG_ENTRY("DFSDM1_Filter2_FLTEXMIN", DFSDM1_Filter2->FLTEXMIN),
    REG_ENTRY("DFSDM1_Filter2_FLTCNVTIMR", DFSDM1_Filter2->FLTCNVTIMR),
    REG_ENTRY("DFSDM1_Filter3_FLTCR1", DFSDM1_Filter3->FLTCR1),
    REG_ENTRY("DFSDM1_Filter3_FLTCR2", DFSDM1_Filter3->FLTCR2),
    REG_ENTRY("DFSDM1_Filter3_FLTISR", DFSDM1_Filter3->FLTISR),
    REG_ENTRY("DFSDM1_Filter3_FLTICR", DFSDM1_Filter3->FLTICR),
    REG_ENTRY("DFSDM1_Filter3_FLTJCHGR", DFSDM1_Filter3->FLTJCHGR),
    REG_ENTRY("DFSDM1_Filter3_FLTFCR", DFSDM1_Filter3->FLTFCR),
    REG_ENTRY("DFSDM1_Filter3_FLTJDATAR", DFSDM1_Filter3->FLTJDATAR),
    REG_ENTRY("DFSDM1_Filter3_FLTRDATAR", DFSDM1_Filter3->FLTRDATAR),
    REG_ENTRY("DFSDM1_Filter3_FLTAWHTR", DFSDM1_Filter3->FLTAWHTR),
    REG_ENTRY("DFSDM1_Filter3_FLTAWLTR", DFSDM1_Filter3->FLTAWLTR),
    REG_ENTRY("DFSDM1_Filter3_FLTAWSR", DFSDM1_Filter3->FLTAWSR),
    REG_ENTRY("DFSDM1_Filter3_FLTAWCFR", DFSDM1_Filter3->FLTAWCFR),
    REG_ENTRY("DFSDM1_Filter3_FLTEXMAX", DFSDM1_Filter3->FLTEXMAX),
    REG_ENTRY("DFSDM1_Filter3_FLTEXMIN", DFSDM1_Filter3->FLTEXMIN),
    REG_ENTRY("DFSDM1_Filter3_FLTCNVTIMR", DFSDM1_Filter3->FLTCNVTIMR),

    // DFSDM_Channel registers
    REG_ENTRY("DFSDM1_Channel0_CHCFGR1", DFSDM1_Channel0->CHCFGR1),
    REG_ENTRY("DFSDM1_Channel0_CHCFGR2", DFSDM1_Channel0->CHCFGR2),
    REG_ENTRY("DFSDM1_Channel0_CHAWSCDR", DFSDM1_Channel0->CHAWSCDR),
    REG_ENTRY("DFSDM1_Channel0_CHWDATAR", DFSDM1_Channel0->CHWDATAR),
    REG_ENTRY("DFSDM1_Channel0_CHDATINR", DFSDM1_Channel0->CHDATINR),
    REG_ENTRY("DFSDM1_Channel1_CHCFGR1", DFSDM1_Channel1->CHCFGR1),
    REG_ENTRY("DFSDM1_Channel1_CHCFGR2", DFSDM1_Channel1->CHCFGR2),
    REG_ENTRY("DFSDM1_Channel1_CHAWSCDR", DFSDM1_Channel1->CHAWSCDR),
    REG_ENTRY("DFSDM1_Channel1_CHWDATAR", DFSDM1_Channel1->CHWDATAR),
    REG_ENTRY("DFSDM1_Channel1_CHDATINR", DFSDM1_Channel1->CHDATINR),
    REG_ENTRY("DFSDM1_Channel2_CHCFGR1", DFSDM1_Channel2->CHCFGR1),
    REG_ENTRY("DFSDM1_Channel2_CHCFGR2", DFSDM1_Channel2->CHCFGR2),
    REG_ENTRY("DFSDM1_Channel2_CHAWSCDR", DFSDM1_Channel2->CHAWSCDR),
    REG_ENTRY("DFSDM1_Channel2_CHWDATAR", DFSDM1_Channel2->CHWDATAR),
    REG_ENTRY("DFSDM1_Channel2_CHDATINR", DFSDM1_Channel2->CHDATINR),
    REG_ENTRY("DFSDM1_Channel3_CHCFGR1", DFSDM1_Channel3->CHCFGR1),
    REG_ENTRY("DFSDM1_Channel3_CHCFGR2", DFSDM1_Channel3->CHCFGR2),
    REG_ENTRY("DFSDM1_Channel3_CHAWSCDR", DFSDM1_Channel3->CHAWSCDR),
    REG_ENTRY("DFSDM1_Channel3_CHWDATAR", DFSDM1_Channel3->CHWDATAR),
    REG_ENTRY("DFSDM1_Channel3_CHDATINR", DFSDM1_Channel3->CHDATINR),
    REG_ENTRY("DFSDM1_Channel4_CHCFGR1", DFSDM1_Channel4->CHCFGR1),
    REG_ENTRY("DFSDM1_Channel4_CHCFGR2", DFSDM1_Channel4->CHCFGR2),
    REG_ENTRY("DFSDM1_Channel4_CHAWSCDR", DFSDM1_Channel4->CHAWSCDR),
    REG_ENTRY("DFSDM1_Channel4_CHWDATAR", DFSDM1_Channel4->CHWDATAR),
    REG_ENTRY("DFSDM1_Channel4_CHDATINR", DFSDM1_Channel4->CHDATINR),
    REG_ENTRY("DFSDM1_Channel5_CHCFGR1", DFSDM1_Channel5->CHCFGR1),
    REG_ENTRY("DFSDM1_Channel5_CHCFGR2", DFSDM1_Channel5->CHCFGR2),
    REG_ENTRY("DFSDM1_Channel5_CHAWSCDR", DFSDM1_Channel5->CHAWSCDR),
    REG_ENTRY("DFSDM1_Channel5_CHWDATAR", DFSDM1_Channel5->CHWDATAR),
    REG_ENTRY("DFSDM1_Channel5_CHDATINR", DFSDM1_Channel5->CHDATINR),
    REG_ENTRY("DFSDM1_Channel6_CHCFGR1", DFSDM1_Channel6->CHCFGR1),
    REG_ENTRY("DFSDM1_Channel6_CHCFGR2", DFSDM1_Channel6->CHCFGR2),
    REG_ENTRY("DFSDM1_Channel6_CHAWSCDR", DFSDM1_Channel6->CHAWSCDR),
    REG_ENTRY("DFSDM1_Channel6_CHWDATAR", DFSDM1_Channel6->CHWDATAR),
    REG_ENTRY("DFSDM1_Channel6_CHDATINR", DFSDM1_Channel6->CHDATINR),
    REG_ENTRY("DFSDM1_Channel7_CHCFGR1", DFSDM1_Channel7->CHCFGR1),
    REG_ENTRY("DFSDM1_Channel7_CHCFGR2", DFSDM1_Channel7->CHCFGR2),
    REG_ENTRY("DFSDM1_Channel7_CHAWSCDR", DFSDM1_Channel7->CHAWSCDR),
    REG_ENTRY("DFSDM1_Channel7_CHWDATAR", DFSDM1_Channel7->CHWDATAR),
    REG_ENTRY("DFSDM1_Channel7_CHDATINR", DFSDM1_Channel7->CHDATINR),

