Zakrzewiaczek/stm32-asm-interpreter/Drivers/Registers/Src/stm32l476xx_registers.c
    // DBGMCU registers
    REG_ENTRY("DBGMCU_IDCODE", DBGMCU->IDCODE),
    REG_ENTRY("DBGMCU_CR", DBGMCU->CR),
    REG_ENTRY("DBGMCU_APB1FZR1", DBGMCU->APB1FZR1),
    REG_ENTRY("DBGMCU_APB1FZR2", DBGMCU->APB1FZR2),
    REG_ENTRY("DBGMCU_APB2FZ", DBGMCU->APB2FZ),

    // DMA_Channel registers
    REG_ENTRY("DMA1_Channel1_CCR", DMA1_Channel1->CCR),
    REG_ENTRY("DMA1_Channel1_CNDTR", DMA1_Channel1->CNDTR),
    REG_ENTRY("DMA1_Channel1_CPAR", DMA1_Channel1->CPAR),
    REG_ENTRY("DMA1_Channel1_CMAR", DMA1_Channel1->CMAR),
    REG_ENTRY("DMA1_Channel2_CCR", DMA1_Channel2->CCR),
    REG_ENTRY("DMA1_Channel2_CNDTR", DMA1_Channel2->CNDTR),
    REG_ENTRY("DMA1_Channel2_CPAR", DMA1_Channel2->CPAR),
    REG_ENTRY("DMA1_Channel2_CMAR", DMA1_Channel2->CMAR),
    REG_ENTRY("DMA1_Channel3_CCR", DMA1_Channel3->CCR),
    REG_ENTRY("DMA1_Channel3_CNDTR", DMA1_Channel3->CNDTR),
    REG_ENTRY("DMA1_Channel3_CPAR", DMA1_Channel3->CPAR),
    REG_ENTRY("DMA1_Channel3_CMAR", DMA1_Channel3->CMAR),
    REG_ENTRY("DMA1_Channel4_CCR", DMA1_Channel4->CCR),
    REG_ENTRY("DMA1_Channel4_CNDTR", DMA1_Channel4->CNDTR),
    REG_ENTRY("DMA1_Channel4_CPAR", DMA1_Channel4->CPAR),
    REG_ENTRY("DMA1_Channel4_CMAR", DMA1_Channel4->CMAR),
    REG_ENTRY("DMA1_Channel5_CCR", DMA1_Channel5->CCR),
    REG_ENTRY("DMA1_Channel5_CNDTR", DMA1_Channel5->CNDTR),
    REG_ENTRY("DMA1_Channel5_CPAR", DMA1_Channel5->CPAR),
    REG_ENTRY("DMA1_Channel5_CMAR", DMA1_Channel5->CMAR),
    REG_ENTRY("DMA1_Channel6_CCR", DMA1_Channel6->CCR),
    REG_ENTRY("DMA1_Channel6_CNDTR", DMA1_Channel6->CNDTR),
    REG_ENTRY("DMA1_Channel6_CPAR", DMA1_Channel6->CPAR),
    REG_ENTRY("DMA1_Channel6_CMAR", DMA1_Channel6->CMAR),
    REG_ENTRY("DMA1_Channel7_CCR", DMA1_Channel7->CCR),
    REG_ENTRY("DMA1_Channel7_CNDTR", DMA1_Channel7->CNDTR),
    REG_ENTRY("DMA1_Channel7_CPAR", DMA1_Channel7->CPAR),
    REG_ENTRY("DMA1_Channel7_CMAR", DMA1_Channel7->CMAR),
    REG_ENTRY("DMA2_Channel1_CCR", DMA2_Channel1->CCR),
    REG_ENTRY("DMA2_Channel1_CNDTR", DMA2_Channel1->CNDTR),
    REG_ENTRY("DMA2_Channel1_CPAR", DMA2_Channel1->CPAR),
    REG_ENTRY("DMA2_Channel1_CMAR", DMA2_Channel1->CMAR),
    REG_ENTRY("DMA2_Channel2_CCR", DMA2_Channel2->CCR),
    REG_ENTRY("DMA2_Channel2_CNDTR", DMA2_Channel2->CNDTR),
    REG_ENTRY("DMA2_Channel2_CPAR", DMA2_Channel2->CPAR),
    REG_ENTRY("DMA2_Channel2_CMAR", DMA2_Channel2->CMAR),
    REG_ENTRY("DMA2_Channel3_CCR", DMA2_Channel3->CCR),
    REG_ENTRY("DMA2_Channel3_CNDTR", DMA2_Channel3->CNDTR),
    REG_ENTRY("DMA2_Channel3_CPAR", DMA2_Channel3->CPAR),
    REG_ENTRY("DMA2_Channel3_CMAR", DMA2_Channel3->CMAR),
    REG_ENTRY("DMA2_Channel4_CCR", DMA2_Channel4->CCR),
    REG_ENTRY("DMA2_Channel4_CNDTR", DMA2_Channel4->CNDTR),
    REG_ENTRY("DMA2_Channel4_CPAR", DMA2_Channel4->CPAR),
    REG_ENTRY("DMA2_Channel4_CMAR", DMA2_Channel4->CMAR),
    REG_ENTRY("DMA2_Channel5_CCR", DMA2_Channel5->CCR),
    REG_ENTRY("DMA2_Channel5_CNDTR", DMA2_Channel5->CNDTR),
    REG_ENTRY("DMA2_Channel5_CPAR", DMA2_Channel5->CPAR),
    REG_ENTRY("DMA2_Channel5_CMAR", DMA2_Channel5->CMAR),
    REG_ENTRY("DMA2_Channel6_CCR", DMA2_Channel6->CCR),
    REG_ENTRY("DMA2_Channel6_CNDTR", DMA2_Channel6->CNDTR),
    REG_ENTRY("DMA2_Channel6_CPAR", DMA2_Channel6->CPAR),
    REG_ENTRY("DMA2_Channel6_CMAR", DMA2_Channel6->CMAR),
    REG_ENTRY("DMA2_Channel7_CCR", DMA2_Channel7->CCR),
    REG_ENTRY("DMA2_Channel7_CNDTR", DMA2_Channel7->CNDTR),
    REG_ENTRY("DMA2_Channel7_CPAR", DMA2_Channel7->CPAR),
    REG_ENTRY("DMA2_Channel7_CMAR", DMA2_Channel7->CMAR),

    // DMA registers
    REG_ENTRY("DMA1_ISR", DMA1->ISR),
    REG_ENTRY("DMA1_IFCR", DMA1->IFCR),
    REG_ENTRY("DMA2_ISR", DMA2->ISR),
    REG_ENTRY("DMA2_IFCR", DMA2->IFCR),

    // DMA_Request registers
    REG_ENTRY("DMA1_CSELR_CSELR", DMA1_CSELR->CSELR),
    REG_ENTRY("DMA2_CSELR_CSELR", DMA2_CSELR->CSELR),

    // EXTI registers
    REG_ENTRY("EXTI_IMR1", EXTI->IMR1),
    REG_ENTRY("EXTI_EMR1", EXTI->EMR1),
    REG_ENTRY("EXTI_RTSR1", EXTI->RTSR1),
    REG_ENTRY("EXTI_FTSR1", EXTI->FTSR1),
    REG_ENTRY("EXTI_SWIER1", EXTI->SWIER1),
    REG_ENTRY("EXTI_PR1", EXTI->PR1),
    REG_ENTRY("EXTI_IMR2", EXTI->IMR2),
    REG_ENTRY("EXTI_EMR2", EXTI->EMR2),
    REG_ENTRY("EXTI_RTSR2", EXTI->RTSR2),
    REG_ENTRY("EXTI_FTSR2", EXTI->FTSR2),
    REG_ENTRY("EXTI_SWIER2", EXTI->SWIER2),
    REG_ENTRY("EXTI_PR2", EXTI->PR2),

    // FIREWALL registers
    REG_ENTRY("FIREWALL_CSSA", FIREWALL->CSSA),
    REG_ENTRY("FIREWALL_CSL", FIREWALL->CSL),
    REG_ENTRY("FIREWALL_NVDSSA", FIREWALL->NVDSSA),
    REG_ENTRY("FIREWALL_NVDSL", FIREWALL->NVDSL),

    // FLASH registers
    REG_ENTRY("FLASH_ACR", FLASH->ACR),
    REG_ENTRY("FLASH_PDKEYR", FLASH->PDKEYR),
    REG_ENTRY("FLASH_KEYR", FLASH->KEYR),
    REG_ENTRY("FLASH_OPTKEYR", FLASH->OPTKEYR),
    REG_ENTRY("FLASH_SR", FLASH->SR),
    REG_ENTRY("FLASH_CR", FLASH->CR),
    REG_ENTRY("FLASH_ECCR", FLASH->ECCR),
    REG_ENTRY("FLASH_OPTR", FLASH->OPTR),
    REG_ENTRY("FLASH_PCROP1SR", FLASH->PCROP1SR),
    REG_ENTRY("FLASH_PCROP1ER", FLASH->PCROP1ER),
    REG_ENTRY("FLASH_WRP1AR", FLASH->WRP1AR),
    REG_ENTRY("FLASH_WRP1BR", FLASH->WRP1BR),
    REG_ENTRY("FLASH_PCROP2SR", FLASH->PCROP2SR),
    REG_ENTRY("FLASH_PCROP2ER", FLASH->PCROP2ER),
    REG_ENTRY("FLASH_WRP2AR", FLASH->WRP2AR),
    REG_ENTRY("FLASH_WRP2BR", FLASH->WRP2BR),

    // FMC_Bank1 registers
    REG_ENTRY("FMC_Bank1_R_BTCR", FMC_Bank1_R->BTCR),

    // FMC_Bank1E registers
    REG_ENTRY("FMC_Bank1E_R_BWTR", FMC_Bank1E_R->BWTR),

    // FMC_Bank3 registers
    REG_ENTRY("FMC_Bank3_R_PCR", FMC_Bank3_R->PCR),
    REG_ENTRY("FMC_Bank3_R_SR", FMC_Bank3_R->SR),
    REG_ENTRY("FMC_Bank3_R_PMEM", FMC_Bank3_R->PMEM),
    REG_ENTRY("FMC_Bank3_R_PATT", FMC_Bank3_R->PATT),
    REG_ENTRY("FMC_Bank3_R_ECCR", FMC_Bank3_R->ECCR),

    // GPIO registers
    REG_ENTRY("GPIOA_MODER", GPIOA->MODER),
    REG_ENTRY("GPIOA_OTYPER", GPIOA->OTYPER),
    REG_ENTRY("GPIOA_OSPEEDR", GPIOA->OSPEEDR),
    REG_ENTRY("GPIOA_PUPDR", GPIOA->PUPDR),
    REG_ENTRY("GPIOA_IDR", GPIOA->IDR),
    REG_ENTRY("GPIOA_ODR", GPIOA->ODR),
    REG_ENTRY("GPIOA_BSRR", GPIOA->BSRR),
    REG_ENTRY("GPIOA_LCKR", GPIOA->LCKR),
    REG_ENTRY("GPIOA_AFR", GPIOA->AFR),
    REG_ENTRY("GPIOA_BRR", GPIOA->BRR),
    REG_ENTRY("GPIOA_ASCR", GPIOA->ASCR),
    REG_ENTRY("GPIOB_MODER", GPIOB->MODER),
    REG_ENTRY("GPIOB_OTYPER", GPIOB->OTYPER),
    REG_ENTRY("GPIOB_OSPEEDR", GPIOB->OSPEEDR),
    REG_ENTRY("GPIOB_PUPDR", GPIOB->PUPDR),
    REG_ENTRY("GPIOB_IDR", GPIOB->IDR),
    REG_ENTRY("GPIOB_ODR", GPIOB->ODR),
    REG_ENTRY("GPIOB_BSRR", GPIOB->BSRR),
    REG_ENTRY("GPIOB_LCKR", GPIOB->LCKR),
    REG_ENTRY("GPIOB_AFR", GPIOB->AFR),
    REG_ENTRY("GPIOB_BRR", GPIOB->BRR),
    REG_ENTRY("GPIOB_ASCR", GPIOB->ASCR),
    REG_ENTRY("GPIOC_MODER", GPIOC->MODER),
    REG_ENTRY("GPIOC_OTYPER", GPIOC->OTYPER),
    REG_ENTRY("GPIOC_OSPEEDR", GPIOC->OSPEEDR),
    REG_ENTRY("GPIOC_PUPDR", GPIOC->PUPDR),
    REG_ENTRY("GPIOC_IDR", GPIOC->IDR),
    REG_ENTRY("GPIOC_ODR", GPIOC->ODR),
    REG_ENTRY("GPIOC_BSRR", GPIOC->BSRR),
    REG_ENTRY("GPIOC_LCKR", GPIOC->LCKR),
    REG_ENTRY("GPIOC_AFR", GPIOC->AFR),
    REG_ENTRY("GPIOC_BRR", GPIOC->BRR),
    REG_ENTRY("GPIOC_ASCR", GPIOC->ASCR),
    REG_ENTRY("GPIOD_MODER", GPIOD->MODER),
    REG_ENTRY("GPIOD_OTYPER", GPIOD->OTYPER),
    REG_ENTRY("GPIOD_OSPEEDR", GPIOD->OSPEEDR),
    REG_ENTRY("GPIOD_PUPDR", GPIOD->PUPDR),
    REG_ENTRY("GPIOD_IDR", GPIOD->IDR),
    REG_ENTRY("GPIOD_ODR", GPIOD->ODR),
    REG_ENTRY("GPIOD_BSRR", GPIOD->BSRR),
    REG_ENTRY("GPIOD_LCKR", GPIOD->LCKR),
    REG_ENTRY("GPIOD_AFR", GPIOD->AFR),
    REG_ENTRY("GPIOD_BRR", GPIOD->BRR),
    REG_ENTRY("GPIOD_ASCR", GPIOD->ASCR),
    REG_ENTRY("GPIOE_MODER", GPIOE->MODER),
    REG_ENTRY("GPIOE_OTYPER", GPIOE->OTYPER),
    REG_ENTRY("GPIOE_OSPEEDR", GPIOE->OSPEEDR),
    REG_ENTRY("GPIOE_PUPDR", GPIOE->PUPDR),
    REG_ENTRY("GPIOE_IDR", GPIOE->IDR),
    REG_ENTRY("GPIOE_ODR", GPIOE->ODR),
    REG_ENTRY("GPIOE_BSRR", GPIOE->BSRR),
    REG_ENTRY("GPIOE_LCKR", GPIOE->LCKR),
    REG_ENTRY("GPIOE_AFR", GPIOE->AFR),
    REG_ENTRY("GPIOE_BRR", GPIOE->BRR),
    REG_ENTRY("GPIOE_ASCR", GPIOE->ASCR),
    REG_ENTRY("GPIOF_MODER", GPIOF->MODER),
    REG_ENTRY("GPIOF_OTYPER", GPIOF->OTYPER),
    REG_ENTRY("GPIOF_OSPEEDR", GPIOF->OSPEEDR),
    REG_ENTRY("GPIOF_PUPDR", GPIOF->PUPDR),
    REG_ENTRY("GPIOF_IDR", GPIOF->IDR),
    REG_ENTRY("GPIOF_ODR", GPIOF->ODR),
    REG_ENTRY("GPIOF_BSRR", GPIOF->BSRR),
    REG_ENTRY("GPIOF_LCKR", GPIOF->LCKR),
    REG_ENTRY("GPIOF_AFR", GPIOF->AFR),
    REG_ENTRY("GPIOF_BRR", GPIOF->BRR),
    REG_ENTRY("GPIOF_ASCR", GPIOF->ASCR),
    REG_ENTRY("GPIOG_MODER", GPIOG->MODER),
    REG_ENTRY("GPIOG_OTYPER", GPIOG->OTYPER),
    REG_ENTRY("GPIOG_OSPEEDR", GPIOG->OSPEEDR),
    REG_ENTRY("GPIOG_PUPDR", GPIOG->PUPDR),
    REG_ENTRY("GPIOG_IDR", GPIOG->IDR),
    REG_ENTRY("GPIOG_ODR", GPIOG->ODR),
    REG_ENTRY("GPIOG_BSRR", GPIOG->BSRR),
    REG_ENTRY("GPIOG_LCKR", GPIOG->LCKR),
    REG_ENTRY("GPIOG_AFR", GPIOG->AFR),
    REG_ENTRY("GPIOG_BRR", GPIOG->BRR),
    REG_ENTRY("GPIOG_ASCR", GPIOG->ASCR),
    REG_ENTRY("GPIOH_MODER", GPIOH->MODER),
    REG_ENTRY("GPIOH_OTYPER", GPIOH->OTYPER),
    REG_ENTRY("GPIOH_OSPEEDR", GPIOH->OSPEEDR),
    REG_ENTRY("GPIOH_PUPDR", GPIOH->PUPDR),
    REG_ENTRY("GPIOH_IDR", GPIOH->IDR),
    REG_ENTRY("GPIOH_ODR", GPIOH->ODR),
    REG_ENTRY("GPIOH_BSRR", GPIOH->BSRR),
    REG_ENTRY("GPIOH_LCKR", GPIOH->LCKR),
    REG_ENTRY("GPIOH_AFR", GPIOH->AFR),
    REG_ENTRY("GPIOH_BRR", GPIOH->BRR),
    REG_ENTRY("GPIOH_ASCR", GPIOH->ASCR),

    // I2C registers
    REG_ENTRY("I2C1_CR1", I2C1->CR1),
    REG_ENTRY("I2C1_CR2", I2C1->CR2),
    REG_ENTRY("I2C1_OAR1", I2C1->OAR1),
    REG_ENTRY("I2C1_OAR2", I2C1->OAR2),
    REG_ENTRY("I2C1_TIMINGR", I2C1->TIMINGR),
    REG_ENTRY("I2C1_TIMEOUTR", I2C1->TIMEOUTR),
    REG_ENTRY("I2C1_ISR", I2C1->ISR),
    REG_ENTRY("I2C1_ICR", I2C1->ICR),
    REG_ENTRY("I2C1_PECR", I2C1->PECR),
    REG_ENTRY("I2C1_RXDR", I2C1->RXDR),
    REG_ENTRY("I2C1_TXDR", I2C1->TXDR),
    REG_ENTRY("I2C2_CR1", I2C2->CR1),
    REG_ENTRY("I2C2_CR2", I2C2->CR2),
    REG_ENTRY("I2C2_OAR1", I2C2->OAR1),
    REG_ENTRY("I2C2_OAR2", I2C2->OAR2),
    REG_ENTRY("I2C2_TIMINGR", I2C2->TIMINGR),
    REG_ENTRY("I2C2_TIMEOUTR", I2C2->TIMEOUTR),
    REG_ENTRY("I2C2_ISR", I2C2->ISR),
    REG_ENTRY("I2C2_ICR", I2C2->ICR),
    REG_ENTRY("I2C2_PECR", I2C2->PECR),
    REG_ENTRY("I2C2_RXDR", I2C2->RXDR),
    REG_ENTRY("I2C2_TXDR", I2C2->TXDR),
    REG_ENTRY("I2C3_CR1", I2C3->CR1),
    REG_ENTRY("I2C3_CR2", I2C3->CR2),
    REG_ENTRY("I2C3_OAR1", I2C3->OAR1),
    REG_ENTRY("I2C3_OAR2", I2C3->OAR2),
    REG_ENTRY("I2C3_TIMINGR", I2C3->TIMINGR),
    REG_ENTRY("I2C3_TIMEOUTR", I2C3->TIMEOUTR),
    REG_ENTRY("I2C3_ISR", I2C3->ISR),
    REG_ENTRY("I2C3_ICR", I2C3->ICR),
    REG_ENTRY("I2C3_PECR", I2C3->PECR),
    REG_ENTRY("I2C3_RXDR", I2C3->RXDR),
    REG_ENTRY("I2C3_TXDR", I2C3->TXDR),

