Zakrzewiaczek/stm32-asm-interpreter/Drivers/Registers/Src/stm32l476xx_registers.c
    // IWDG registers
    REG_ENTRY("IWDG_KR", IWDG->KR),
    REG_ENTRY("IWDG_PR", IWDG->PR),
    REG_ENTRY("IWDG_RLR", IWDG->RLR),
    REG_ENTRY("IWDG_SR", IWDG->SR),
    REG_ENTRY("IWDG_WINR", IWDG->WINR),

    // LCD registers
    REG_ENTRY("LCD_CR", LCD->CR),
    REG_ENTRY("LCD_FCR", LCD->FCR),
    REG_ENTRY("LCD_SR", LCD->SR),
    REG_ENTRY("LCD_CLR", LCD->CLR),
    REG_ENTRY("LCD_RAM", LCD->RAM),

    // LPTIM registers
    REG_ENTRY("LPTIM1_ISR", LPTIM1->ISR),
    REG_ENTRY("LPTIM1_ICR", LPTIM1->ICR),
    REG_ENTRY("LPTIM1_IER", LPTIM1->IER),
    REG_ENTRY("LPTIM1_CFGR", LPTIM1->CFGR),
    REG_ENTRY("LPTIM1_CR", LPTIM1->CR),
    REG_ENTRY("LPTIM1_CMP", LPTIM1->CMP),
    REG_ENTRY("LPTIM1_ARR", LPTIM1->ARR),
    REG_ENTRY("LPTIM1_CNT", LPTIM1->CNT),
    REG_ENTRY("LPTIM1_OR", LPTIM1->OR),
    REG_ENTRY("LPTIM2_ISR", LPTIM2->ISR),
    REG_ENTRY("LPTIM2_ICR", LPTIM2->ICR),
    REG_ENTRY("LPTIM2_IER", LPTIM2->IER),
    REG_ENTRY("LPTIM2_CFGR", LPTIM2->CFGR),
    REG_ENTRY("LPTIM2_CR", LPTIM2->CR),
    REG_ENTRY("LPTIM2_CMP", LPTIM2->CMP),
    REG_ENTRY("LPTIM2_ARR", LPTIM2->ARR),
    REG_ENTRY("LPTIM2_CNT", LPTIM2->CNT),
    REG_ENTRY("LPTIM2_OR", LPTIM2->OR),

    // OPAMP registers
    REG_ENTRY("OPAMP_CSR", OPAMP->CSR),
    REG_ENTRY("OPAMP_OTR", OPAMP->OTR),
    REG_ENTRY("OPAMP_LPOTR", OPAMP->LPOTR),
    REG_ENTRY("OPAMP1_CSR", OPAMP1->CSR),
    REG_ENTRY("OPAMP1_OTR", OPAMP1->OTR),
    REG_ENTRY("OPAMP1_LPOTR", OPAMP1->LPOTR),
    REG_ENTRY("OPAMP2_CSR", OPAMP2->CSR),
    REG_ENTRY("OPAMP2_OTR", OPAMP2->OTR),
    REG_ENTRY("OPAMP2_LPOTR", OPAMP2->LPOTR),

    // OPAMP_Common registers
    REG_ENTRY("OPAMP12_COMMON_CSR", OPAMP12_COMMON->CSR),

    // PWR registers
    REG_ENTRY("PWR_CR1", PWR->CR1),
    REG_ENTRY("PWR_CR2", PWR->CR2),
    REG_ENTRY("PWR_CR3", PWR->CR3),
    REG_ENTRY("PWR_CR4", PWR->CR4),
    REG_ENTRY("PWR_SR1", PWR->SR1),
    REG_ENTRY("PWR_SR2", PWR->SR2),
    REG_ENTRY("PWR_SCR", PWR->SCR),
    REG_ENTRY("PWR_PUCRA", PWR->PUCRA),
    REG_ENTRY("PWR_PDCRA", PWR->PDCRA),
    REG_ENTRY("PWR_PUCRB", PWR->PUCRB),
    REG_ENTRY("PWR_PDCRB", PWR->PDCRB),
    REG_ENTRY("PWR_PUCRC", PWR->PUCRC),
    REG_ENTRY("PWR_PDCRC", PWR->PDCRC),
    REG_ENTRY("PWR_PUCRD", PWR->PUCRD),
    REG_ENTRY("PWR_PDCRD", PWR->PDCRD),
    REG_ENTRY("PWR_PUCRE", PWR->PUCRE),
    REG_ENTRY("PWR_PDCRE", PWR->PDCRE),
    REG_ENTRY("PWR_PUCRF", PWR->PUCRF),
    REG_ENTRY("PWR_PDCRF", PWR->PDCRF),
    REG_ENTRY("PWR_PUCRG", PWR->PUCRG),
    REG_ENTRY("PWR_PDCRG", PWR->PDCRG),
    REG_ENTRY("PWR_PUCRH", PWR->PUCRH),
    REG_ENTRY("PWR_PDCRH", PWR->PDCRH),

    // QUADSPI registers
    REG_ENTRY("QUADSPI_CR", QUADSPI->CR),
    REG_ENTRY("QUADSPI_DCR", QUADSPI->DCR),
    REG_ENTRY("QUADSPI_SR", QUADSPI->SR),
    REG_ENTRY("QUADSPI_FCR", QUADSPI->FCR),
    REG_ENTRY("QUADSPI_DLR", QUADSPI->DLR),
    REG_ENTRY("QUADSPI_CCR", QUADSPI->CCR),
    REG_ENTRY("QUADSPI_AR", QUADSPI->AR),
    REG_ENTRY("QUADSPI_ABR", QUADSPI->ABR),
    REG_ENTRY("QUADSPI_DR", QUADSPI->DR),
    REG_ENTRY("QUADSPI_PSMKR", QUADSPI->PSMKR),
    REG_ENTRY("QUADSPI_PSMAR", QUADSPI->PSMAR),
    REG_ENTRY("QUADSPI_PIR", QUADSPI->PIR),
    REG_ENTRY("QUADSPI_LPTR", QUADSPI->LPTR),

    // RCC registers
    REG_ENTRY("RCC_CR", RCC->CR),
    REG_ENTRY("RCC_ICSCR", RCC->ICSCR),
    REG_ENTRY("RCC_CFGR", RCC->CFGR),
    REG_ENTRY("RCC_PLLCFGR", RCC->PLLCFGR),
    REG_ENTRY("RCC_PLLSAI1CFGR", RCC->PLLSAI1CFGR),
    REG_ENTRY("RCC_PLLSAI2CFGR", RCC->PLLSAI2CFGR),
    REG_ENTRY("RCC_CIER", RCC->CIER),
    REG_ENTRY("RCC_CIFR", RCC->CIFR),
    REG_ENTRY("RCC_CICR", RCC->CICR),
    REG_ENTRY("RCC_AHB1RSTR", RCC->AHB1RSTR),
    REG_ENTRY("RCC_AHB2RSTR", RCC->AHB2RSTR),
    REG_ENTRY("RCC_AHB3RSTR", RCC->AHB3RSTR),
    REG_ENTRY("RCC_APB1RSTR1", RCC->APB1RSTR1),
    REG_ENTRY("RCC_APB1RSTR2", RCC->APB1RSTR2),
    REG_ENTRY("RCC_APB2RSTR", RCC->APB2RSTR),
    REG_ENTRY("RCC_AHB1ENR", RCC->AHB1ENR),
    REG_ENTRY("RCC_AHB2ENR", RCC->AHB2ENR),
    REG_ENTRY("RCC_AHB3ENR", RCC->AHB3ENR),
    REG_ENTRY("RCC_APB1ENR1", RCC->APB1ENR1),
    REG_ENTRY("RCC_APB1ENR2", RCC->APB1ENR2),
    REG_ENTRY("RCC_APB2ENR", RCC->APB2ENR),
    REG_ENTRY("RCC_AHB1SMENR", RCC->AHB1SMENR),
    REG_ENTRY("RCC_AHB2SMENR", RCC->AHB2SMENR),
    REG_ENTRY("RCC_AHB3SMENR", RCC->AHB3SMENR),
    REG_ENTRY("RCC_APB1SMENR1", RCC->APB1SMENR1),
    REG_ENTRY("RCC_APB1SMENR2", RCC->APB1SMENR2),
    REG_ENTRY("RCC_APB2SMENR", RCC->APB2SMENR),
    REG_ENTRY("RCC_CCIPR", RCC->CCIPR),
    REG_ENTRY("RCC_BDCR", RCC->BDCR),
    REG_ENTRY("RCC_CSR", RCC->CSR),

    // RTC registers
    REG_ENTRY("RTC_TR", RTC->TR),
    REG_ENTRY("RTC_DR", RTC->DR),
    REG_ENTRY("RTC_CR", RTC->CR),
    REG_ENTRY("RTC_ISR", RTC->ISR),
    REG_ENTRY("RTC_PRER", RTC->PRER),
    REG_ENTRY("RTC_WUTR", RTC->WUTR),
    REG_ENTRY("RTC_ALRMAR", RTC->ALRMAR),
    REG_ENTRY("RTC_ALRMBR", RTC->ALRMBR),
    REG_ENTRY("RTC_WPR", RTC->WPR),
    REG_ENTRY("RTC_SSR", RTC->SSR),
    REG_ENTRY("RTC_SHIFTR", RTC->SHIFTR),
    REG_ENTRY("RTC_TSTR", RTC->TSTR),
    REG_ENTRY("RTC_TSDR", RTC->TSDR),
    REG_ENTRY("RTC_TSSSR", RTC->TSSSR),
    REG_ENTRY("RTC_CALR", RTC->CALR),
    REG_ENTRY("RTC_TAMPCR", RTC->TAMPCR),
    REG_ENTRY("RTC_ALRMASSR", RTC->ALRMASSR),
    REG_ENTRY("RTC_ALRMBSSR", RTC->ALRMBSSR),
    REG_ENTRY("RTC_OR", RTC->OR),
    REG_ENTRY("RTC_BKP0R", RTC->BKP0R),
    REG_ENTRY("RTC_BKP1R", RTC->BKP1R),
    REG_ENTRY("RTC_BKP2R", RTC->BKP2R),
    REG_ENTRY("RTC_BKP3R", RTC->BKP3R),
    REG_ENTRY("RTC_BKP4R", RTC->BKP4R),
    REG_ENTRY("RTC_BKP5R", RTC->BKP5R),
    REG_ENTRY("RTC_BKP6R", RTC->BKP6R),
    REG_ENTRY("RTC_BKP7R", RTC->BKP7R),
    REG_ENTRY("RTC_BKP8R", RTC->BKP8R),
    REG_ENTRY("RTC_BKP9R", RTC->BKP9R),
    REG_ENTRY("RTC_BKP10R", RTC->BKP10R),
    REG_ENTRY("RTC_BKP11R", RTC->BKP11R),
    REG_ENTRY("RTC_BKP12R", RTC->BKP12R),
    REG_ENTRY("RTC_BKP13R", RTC->BKP13R),
    REG_ENTRY("RTC_BKP14R", RTC->BKP14R),
    REG_ENTRY("RTC_BKP15R", RTC->BKP15R),
    REG_ENTRY("RTC_BKP16R", RTC->BKP16R),
    REG_ENTRY("RTC_BKP17R", RTC->BKP17R),
    REG_ENTRY("RTC_BKP18R", RTC->BKP18R),
    REG_ENTRY("RTC_BKP19R", RTC->BKP19R),
    REG_ENTRY("RTC_BKP20R", RTC->BKP20R),
    REG_ENTRY("RTC_BKP21R", RTC->BKP21R),
    REG_ENTRY("RTC_BKP22R", RTC->BKP22R),
    REG_ENTRY("RTC_BKP23R", RTC->BKP23R),
    REG_ENTRY("RTC_BKP24R", RTC->BKP24R),
    REG_ENTRY("RTC_BKP25R", RTC->BKP25R),
    REG_ENTRY("RTC_BKP26R", RTC->BKP26R),
    REG_ENTRY("RTC_BKP27R", RTC->BKP27R),
    REG_ENTRY("RTC_BKP28R", RTC->BKP28R),
    REG_ENTRY("RTC_BKP29R", RTC->BKP29R),
    REG_ENTRY("RTC_BKP30R", RTC->BKP30R),
    REG_ENTRY("RTC_BKP31R", RTC->BKP31R),

    // SAI registers
    REG_ENTRY("SAI1_GCR", SAI1->GCR),
    REG_ENTRY("SAI2_GCR", SAI2->GCR),

