Zakrzewiaczek/stm32-asm-interpreter/Drivers/Registers/Src/stm32l476xx_registers.c
    // SAI_Block registers
    REG_ENTRY("SAI1_Block_A_CR1", SAI1_Block_A->CR1),
    REG_ENTRY("SAI1_Block_A_CR2", SAI1_Block_A->CR2),
    REG_ENTRY("SAI1_Block_A_FRCR", SAI1_Block_A->FRCR),
    REG_ENTRY("SAI1_Block_A_SLOTR", SAI1_Block_A->SLOTR),
    REG_ENTRY("SAI1_Block_A_IMR", SAI1_Block_A->IMR),
    REG_ENTRY("SAI1_Block_A_SR", SAI1_Block_A->SR),
    REG_ENTRY("SAI1_Block_A_CLRFR", SAI1_Block_A->CLRFR),
    REG_ENTRY("SAI1_Block_A_DR", SAI1_Block_A->DR),
    REG_ENTRY("SAI1_Block_B_CR1", SAI1_Block_B->CR1),
    REG_ENTRY("SAI1_Block_B_CR2", SAI1_Block_B->CR2),
    REG_ENTRY("SAI1_Block_B_FRCR", SAI1_Block_B->FRCR),
    REG_ENTRY("SAI1_Block_B_SLOTR", SAI1_Block_B->SLOTR),
    REG_ENTRY("SAI1_Block_B_IMR", SAI1_Block_B->IMR),
    REG_ENTRY("SAI1_Block_B_SR", SAI1_Block_B->SR),
    REG_ENTRY("SAI1_Block_B_CLRFR", SAI1_Block_B->CLRFR),
    REG_ENTRY("SAI1_Block_B_DR", SAI1_Block_B->DR),
    REG_ENTRY("SAI2_Block_A_CR1", SAI2_Block_A->CR1),
    REG_ENTRY("SAI2_Block_A_CR2", SAI2_Block_A->CR2),
    REG_ENTRY("SAI2_Block_A_FRCR", SAI2_Block_A->FRCR),
    REG_ENTRY("SAI2_Block_A_SLOTR", SAI2_Block_A->SLOTR),
    REG_ENTRY("SAI2_Block_A_IMR", SAI2_Block_A->IMR),
    REG_ENTRY("SAI2_Block_A_SR", SAI2_Block_A->SR),
    REG_ENTRY("SAI2_Block_A_CLRFR", SAI2_Block_A->CLRFR),
    REG_ENTRY("SAI2_Block_A_DR", SAI2_Block_A->DR),
    REG_ENTRY("SAI2_Block_B_CR1", SAI2_Block_B->CR1),
    REG_ENTRY("SAI2_Block_B_CR2", SAI2_Block_B->CR2),
    REG_ENTRY("SAI2_Block_B_FRCR", SAI2_Block_B->FRCR),
    REG_ENTRY("SAI2_Block_B_SLOTR", SAI2_Block_B->SLOTR),
    REG_ENTRY("SAI2_Block_B_IMR", SAI2_Block_B->IMR),
    REG_ENTRY("SAI2_Block_B_SR", SAI2_Block_B->SR),
    REG_ENTRY("SAI2_Block_B_CLRFR", SAI2_Block_B->CLRFR),
    REG_ENTRY("SAI2_Block_B_DR", SAI2_Block_B->DR),

    // SDMMC registers
    REG_ENTRY("SDMMC1_POWER", SDMMC1->POWER),
    REG_ENTRY("SDMMC1_CLKCR", SDMMC1->CLKCR),
    REG_ENTRY("SDMMC1_ARG", SDMMC1->ARG),
    REG_ENTRY("SDMMC1_CMD", SDMMC1->CMD),
    REG_ENTRY("SDMMC1_RESPCMD", SDMMC1->RESPCMD),
    REG_ENTRY("SDMMC1_RESP1", SDMMC1->RESP1),
    REG_ENTRY("SDMMC1_RESP2", SDMMC1->RESP2),
    REG_ENTRY("SDMMC1_RESP3", SDMMC1->RESP3),
    REG_ENTRY("SDMMC1_RESP4", SDMMC1->RESP4),
    REG_ENTRY("SDMMC1_DTIMER", SDMMC1->DTIMER),
    REG_ENTRY("SDMMC1_DLEN", SDMMC1->DLEN),
    REG_ENTRY("SDMMC1_DCTRL", SDMMC1->DCTRL),
    REG_ENTRY("SDMMC1_DCOUNT", SDMMC1->DCOUNT),
    REG_ENTRY("SDMMC1_STA", SDMMC1->STA),
    REG_ENTRY("SDMMC1_ICR", SDMMC1->ICR),
    REG_ENTRY("SDMMC1_MASK", SDMMC1->MASK),
    REG_ENTRY("SDMMC1_FIFOCNT", SDMMC1->FIFOCNT),
    REG_ENTRY("SDMMC1_FIFO", SDMMC1->FIFO),

    // SPI registers
    REG_ENTRY("SPI2_CR1", SPI2->CR1),
    REG_ENTRY("SPI2_CR2", SPI2->CR2),
    REG_ENTRY("SPI2_SR", SPI2->SR),
    REG_ENTRY("SPI2_DR", SPI2->DR),
    REG_ENTRY("SPI2_CRCPR", SPI2->CRCPR),
    REG_ENTRY("SPI2_RXCRCR", SPI2->RXCRCR),
    REG_ENTRY("SPI2_TXCRCR", SPI2->TXCRCR),
    REG_ENTRY("SPI3_CR1", SPI3->CR1),
    REG_ENTRY("SPI3_CR2", SPI3->CR2),
    REG_ENTRY("SPI3_SR", SPI3->SR),
    REG_ENTRY("SPI3_DR", SPI3->DR),
    REG_ENTRY("SPI3_CRCPR", SPI3->CRCPR),
    REG_ENTRY("SPI3_RXCRCR", SPI3->RXCRCR),
    REG_ENTRY("SPI3_TXCRCR", SPI3->TXCRCR),
    REG_ENTRY("SPI1_CR1", SPI1->CR1),
    REG_ENTRY("SPI1_CR2", SPI1->CR2),
    REG_ENTRY("SPI1_SR", SPI1->SR),
    REG_ENTRY("SPI1_DR", SPI1->DR),
    REG_ENTRY("SPI1_CRCPR", SPI1->CRCPR),
    REG_ENTRY("SPI1_RXCRCR", SPI1->RXCRCR),
    REG_ENTRY("SPI1_TXCRCR", SPI1->TXCRCR),

    // SWPMI registers
    REG_ENTRY("SWPMI1_CR", SWPMI1->CR),
    REG_ENTRY("SWPMI1_BRR", SWPMI1->BRR),
    REG_ENTRY("SWPMI1_ISR", SWPMI1->ISR),
    REG_ENTRY("SWPMI1_ICR", SWPMI1->ICR),
    REG_ENTRY("SWPMI1_IER", SWPMI1->IER),
    REG_ENTRY("SWPMI1_RFL", SWPMI1->RFL),
    REG_ENTRY("SWPMI1_TDR", SWPMI1->TDR),
    REG_ENTRY("SWPMI1_RDR", SWPMI1->RDR),
    REG_ENTRY("SWPMI1_OR", SWPMI1->OR),

    // SYSCFG registers
    REG_ENTRY("SYSCFG_MEMRMP", SYSCFG->MEMRMP),
    REG_ENTRY("SYSCFG_CFGR1", SYSCFG->CFGR1),
    REG_ENTRY("SYSCFG_EXTICR", SYSCFG->EXTICR),
    REG_ENTRY("SYSCFG_SCSR", SYSCFG->SCSR),
    REG_ENTRY("SYSCFG_CFGR2", SYSCFG->CFGR2),
    REG_ENTRY("SYSCFG_SWPR", SYSCFG->SWPR),
    REG_ENTRY("SYSCFG_SKR", SYSCFG->SKR),

    // TIM registers
    REG_ENTRY("TIM2_CR1", TIM2->CR1),
    REG_ENTRY("TIM2_CR2", TIM2->CR2),
    REG_ENTRY("TIM2_SMCR", TIM2->SMCR),
    REG_ENTRY("TIM2_DIER", TIM2->DIER),
    REG_ENTRY("TIM2_SR", TIM2->SR),
    REG_ENTRY("TIM2_EGR", TIM2->EGR),
    REG_ENTRY("TIM2_CCMR1", TIM2->CCMR1),
    REG_ENTRY("TIM2_CCMR2", TIM2->CCMR2),
    REG_ENTRY("TIM2_CCER", TIM2->CCER),
    REG_ENTRY("TIM2_CNT", TIM2->CNT),
    REG_ENTRY("TIM2_PSC", TIM2->PSC),
    REG_ENTRY("TIM2_ARR", TIM2->ARR),
    REG_ENTRY("TIM2_RCR", TIM2->RCR),
    REG_ENTRY("TIM2_CCR1", TIM2->CCR1),
    REG_ENTRY("TIM2_CCR2", TIM2->CCR2),
    REG_ENTRY("TIM2_CCR3", TIM2->CCR3),
    REG_ENTRY("TIM2_CCR4", TIM2->CCR4),
    REG_ENTRY("TIM2_BDTR", TIM2->BDTR),
    REG_ENTRY("TIM2_DCR", TIM2->DCR),
    REG_ENTRY("TIM2_DMAR", TIM2->DMAR),
    REG_ENTRY("TIM2_OR1", TIM2->OR1),
    REG_ENTRY("TIM2_CCMR3", TIM2->CCMR3),
    REG_ENTRY("TIM2_CCR5", TIM2->CCR5),
    REG_ENTRY("TIM2_CCR6", TIM2->CCR6),
    REG_ENTRY("TIM2_OR2", TIM2->OR2),
    REG_ENTRY("TIM2_OR3", TIM2->OR3),
    REG_ENTRY("TIM3_CR1", TIM3->CR1),
    REG_ENTRY("TIM3_CR2", TIM3->CR2),
    REG_ENTRY("TIM3_SMCR", TIM3->SMCR),
    REG_ENTRY("TIM3_DIER", TIM3->DIER),
    REG_ENTRY("TIM3_SR", TIM3->SR),
    REG_ENTRY("TIM3_EGR", TIM3->EGR),
    REG_ENTRY("TIM3_CCMR1", TIM3->CCMR1),
    REG_ENTRY("TIM3_CCMR2", TIM3->CCMR2),
    REG_ENTRY("TIM3_CCER", TIM3->CCER),
    REG_ENTRY("TIM3_CNT", TIM3->CNT),
    REG_ENTRY("TIM3_PSC", TIM3->PSC),
    REG_ENTRY("TIM3_ARR", TIM3->ARR),
    REG_ENTRY("TIM3_RCR", TIM3->RCR),
    REG_ENTRY("TIM3_CCR1", TIM3->CCR1),
    REG_ENTRY("TIM3_CCR2", TIM3->CCR2),
    REG_ENTRY("TIM3_CCR3", TIM3->CCR3),
    REG_ENTRY("TIM3_CCR4", TIM3->CCR4),
    REG_ENTRY("TIM3_BDTR", TIM3->BDTR),
    REG_ENTRY("TIM3_DCR", TIM3->DCR),
    REG_ENTRY("TIM3_DMAR", TIM3->DMAR),
    REG_ENTRY("TIM3_OR1", TIM3->OR1),
    REG_ENTRY("TIM3_CCMR3", TIM3->CCMR3),
    REG_ENTRY("TIM3_CCR5", TIM3->CCR5),
    REG_ENTRY("TIM3_CCR6", TIM3->CCR6),
    REG_ENTRY("TIM3_OR2", TIM3->OR2),
    REG_ENTRY("TIM3_OR3", TIM3->OR3),
    REG_ENTRY("TIM4_CR1", TIM4->CR1),
    REG_ENTRY("TIM4_CR2", TIM4->CR2),
    REG_ENTRY("TIM4_SMCR", TIM4->SMCR),
    REG_ENTRY("TIM4_DIER", TIM4->DIER),
    REG_ENTRY("TIM4_SR", TIM4->SR),
    REG_ENTRY("TIM4_EGR", TIM4->EGR),
    REG_ENTRY("TIM4_CCMR1", TIM4->CCMR1),
    REG_ENTRY("TIM4_CCMR2", TIM4->CCMR2),
    REG_ENTRY("TIM4_CCER", TIM4->CCER),
    REG_ENTRY("TIM4_CNT", TIM4->CNT),
    REG_ENTRY("TIM4_PSC", TIM4->PSC),
    REG_ENTRY("TIM4_ARR", TIM4->ARR),
    REG_ENTRY("TIM4_RCR", TIM4->RCR),
    REG_ENTRY("TIM4_CCR1", TIM4->CCR1),
    REG_ENTRY("TIM4_CCR2", TIM4->CCR2),
    REG_ENTRY("TIM4_CCR3", TIM4->CCR3),
    REG_ENTRY("TIM4_CCR4", TIM4->CCR4),
    REG_ENTRY("TIM4_BDTR", TIM4->BDTR),
    REG_ENTRY("TIM4_DCR", TIM4->DCR),
    REG_ENTRY("TIM4_DMAR", TIM4->DMAR),
    REG_ENTRY("TIM4_OR1", TIM4->OR1),
    REG_ENTRY("TIM4_CCMR3", TIM4->CCMR3),
    REG_ENTRY("TIM4_CCR5", TIM4->CCR5),
    REG_ENTRY("TIM4_CCR6", TIM4->CCR6),
    REG_ENTRY("TIM4_OR2", TIM4->OR2),
    REG_ENTRY("TIM4_OR3", TIM4->OR3),
    REG_ENTRY("TIM5_CR1", TIM5->CR1),
    REG_ENTRY("TIM5_CR2", TIM5->CR2),
    REG_ENTRY("TIM5_SMCR", TIM5->SMCR),
    REG_ENTRY("TIM5_DIER", TIM5->DIER),
    REG_ENTRY("TIM5_SR", TIM5->SR),
    REG_ENTRY("TIM5_EGR", TIM5->EGR),
    REG_ENTRY("TIM5_CCMR1", TIM5->CCMR1),
    REG_ENTRY("TIM5_CCMR2", TIM5->CCMR2),
    REG_ENTRY("TIM5_CCER", TIM5->CCER),
    REG_ENTRY("TIM5_CNT", TIM5->CNT),
    REG_ENTRY("TIM5_PSC", TIM5->PSC),
    REG_ENTRY("TIM5_ARR", TIM5->ARR),
    REG_ENTRY("TIM5_RCR", TIM5->RCR),
    REG_ENTRY("TIM5_CCR1", TIM5->CCR1),
    REG_ENTRY("TIM5_CCR2", TIM5->CCR2),
    REG_ENTRY("TIM5_CCR3", TIM5->CCR3),
    REG_ENTRY("TIM5_CCR4", TIM5->CCR4),
    REG_ENTRY("TIM5_BDTR", TIM5->BDTR),
    REG_ENTRY("TIM5_DCR", TIM5->DCR),
    REG_ENTRY("TIM5_DMAR", TIM5->DMAR),
    REG_ENTRY("TIM5_OR1", TIM5->OR1),
    REG_ENTRY("TIM5_CCMR3", TIM5->CCMR3),
    REG_ENTRY("TIM5_CCR5", TIM5->CCR5),
    REG_ENTRY("TIM5_CCR6", TIM5->CCR6),
    REG_ENTRY("TIM5_OR2", TIM5->OR2),
    REG_ENTRY("TIM5_OR3", TIM5->OR3),
    REG_ENTRY("TIM6_CR1", TIM6->CR1),
    REG_ENTRY("TIM6_CR2", TIM6->CR2),
    REG_ENTRY("TIM6_SMCR", TIM6->SMCR),
    REG_ENTRY("TIM6_DIER", TIM6->DIER),
    REG_ENTRY("TIM6_SR", TIM6->SR),
    REG_ENTRY("TIM6_EGR", TIM6->EGR),
    REG_ENTRY("TIM6_CCMR1", TIM6->CCMR1),
    REG_ENTRY("TIM6_CCMR2", TIM6->CCMR2),
    REG_ENTRY("TIM6_CCER", TIM6->CCER),
    REG_ENTRY("TIM6_CNT", TIM6->CNT),
    REG_ENTRY("TIM6_PSC", TIM6->PSC),
    REG_ENTRY("TIM6_ARR", TIM6->ARR),
    REG_ENTRY("TIM6_RCR", TIM6->RCR),
    REG_ENTRY("TIM6_CCR1", TIM6->CCR1),
    REG_ENTRY("TIM6_CCR2", TIM6->CCR2),
    REG_ENTRY("TIM6_CCR3", TIM6->CCR3),
    REG_ENTRY("TIM6_CCR4", TIM6->CCR4),
    REG_ENTRY("TIM6_BDTR", TIM6->BDTR),
    REG_ENTRY("TIM6_DCR", TIM6->DCR),
    REG_ENTRY("TIM6_DMAR", TIM6->DMAR),
    REG_ENTRY("TIM6_OR1", TIM6->OR1),
    REG_ENTRY("TIM6_CCMR3", TIM6->CCMR3),
    REG_ENTRY("TIM6_CCR5", TIM6->CCR5),
    REG_ENTRY("TIM6_CCR6", TIM6->CCR6),
    REG_ENTRY("TIM6_OR2", TIM6->OR2),
    REG_ENTRY("TIM6_OR3", TIM6->OR3),
    REG_ENTRY("TIM7_CR1", TIM7->CR1),
    REG_ENTRY("TIM7_CR2", TIM7->CR2),
    REG_ENTRY("TIM7_SMCR", TIM7->SMCR),
    REG_ENTRY("TIM7_DIER", TIM7->DIER),
    REG_ENTRY("TIM7_SR", TIM7->SR),
    REG_ENTRY("TIM7_EGR", TIM7->EGR),
    REG_ENTRY("TIM7_CCMR1", TIM7->CCMR1),
    REG_ENTRY("TIM7_CCMR2", TIM7->CCMR2),
    REG_ENTRY("TIM7_CCER", TIM7->CCER),
    REG_ENTRY("TIM7_CNT", TIM7->CNT),
    REG_ENTRY("TIM7_PSC", TIM7->PSC),
    REG_ENTRY("TIM7_ARR", TIM7->ARR),
    REG_ENTRY("TIM7_RCR", TIM7->RCR),
    REG_ENTRY("TIM7_CCR1", TIM7->CCR1),
    REG_ENTRY("TIM7_CCR2", TIM7->CCR2),
    REG_ENTRY("TIM7_CCR3", TIM7->CCR3),
    REG_ENTRY("TIM7_CCR4", TIM7->CCR4),
    REG_ENTRY("TIM7_BDTR", TIM7->BDTR),
    REG_ENTRY("TIM7_DCR", TIM7->DCR),
    REG_ENTRY("TIM7_DMAR", TIM7->DMAR),
    REG_ENTRY("TIM7_OR1", TIM7->OR1),
    REG_ENTRY("TIM7_CCMR3", TIM7->CCMR3),
    REG_ENTRY("TIM7_CCR5", TIM7->CCR5),
    REG_ENTRY("TIM7_CCR6", TIM7->CCR6),
    REG_ENTRY("TIM7_OR2", TIM7->OR2),
    REG_ENTRY("TIM7_OR3", TIM7->OR3),
    REG_ENTRY("TIM1_CR1", TIM1->CR1),
    REG_ENTRY("TIM1_CR2", TIM1->CR2),
    REG_ENTRY("TIM1_SMCR", TIM1->SMCR),
    REG_ENTRY("TIM1_DIER", TIM1->DIER),
    REG_ENTRY("TIM1_SR", TIM1->SR),
    REG_ENTRY("TIM1_EGR", TIM1->EGR),
    REG_ENTRY("TIM1_CCMR1", TIM1->CCMR1),
    REG_ENTRY("TIM1_CCMR2", TIM1->CCMR2),
    REG_ENTRY("TIM1_CCER", TIM1->CCER),
    REG_ENTRY("TIM1_CNT", TIM1->CNT),
    REG_ENTRY("TIM1_PSC", TIM1->PSC),
    REG_ENTRY("TIM1_ARR", TIM1->ARR),
    REG_ENTRY("TIM1_RCR", TIM1->RCR),
    REG_ENTRY("TIM1_CCR1", TIM1->CCR1),
    REG_ENTRY("TIM1_CCR2", TIM1->CCR2),
    REG_ENTRY("TIM1_CCR3", TIM1->CCR3),
    REG_ENTRY("TIM1_CCR4", TIM1->CCR4),
    REG_ENTRY("TIM1_BDTR", TIM1->BDTR),
    REG_ENTRY("TIM1_DCR", TIM1->DCR),
    REG_ENTRY("TIM1_DMAR", TIM1->DMAR),
    REG_ENTRY("TIM1_OR1", TIM1->OR1),
    REG_ENTRY("TIM1_CCMR3", TIM1->CCMR3),
    REG_ENTRY("TIM1_CCR5", TIM1->CCR5),
    REG_ENTRY("TIM1_CCR6", TIM1->CCR6),
    REG_ENTRY("TIM1_OR2", TIM1->OR2),
    REG_ENTRY("TIM1_OR3", TIM1->OR3),
    REG_ENTRY("TIM8_CR1", TIM8->CR1),
    REG_ENTRY("TIM8_CR2", TIM8->CR2),
    REG_ENTRY("TIM8_SMCR", TIM8->SMCR),
    REG_ENTRY("TIM8_DIER", TIM8->DIER),
    REG_ENTRY("TIM8_SR", TIM8->SR),
    REG_ENTRY("TIM8_EGR", TIM8->EGR),
    REG_ENTRY("TIM8_CCMR1", TIM8->CCMR1),
    REG_ENTRY("TIM8_CCMR2", TIM8->CCMR2),
    REG_ENTRY("TIM8_CCER", TIM8->CCER),
    REG_ENTRY("TIM8_CNT", TIM8->CNT),
    REG_ENTRY("TIM8_PSC", TIM8->PSC),
    REG_ENTRY("TIM8_ARR", TIM8->ARR),
    REG_ENTRY("TIM8_RCR", TIM8->RCR),
    REG_ENTRY("TIM8_CCR1", TIM8->CCR1),
    REG_ENTRY("TIM8_CCR2", TIM8->CCR2),
    REG_ENTRY("TIM8_CCR3", TIM8->CCR3),
    REG_ENTRY("TIM8_CCR4", TIM8->CCR4),
    REG_ENTRY("TIM8_BDTR", TIM8->BDTR),
    REG_ENTRY("TIM8_DCR", TIM8->DCR),
    REG_ENTRY("TIM8_DMAR", TIM8->DMAR),
    REG_ENTRY("TIM8_OR1", TIM8->OR1),
    REG_ENTRY("TIM8_CCMR3", TIM8->CCMR3),
    REG_ENTRY("TIM8_CCR5", TIM8->CCR5),
    REG_ENTRY("TIM8_CCR6", TIM8->CCR6),
    REG_ENTRY("TIM8_OR2", TIM8->OR2),
    REG_ENTRY("TIM8_OR3", TIM8->OR3),
    REG_ENTRY("TIM15_CR1", TIM15->CR1),
    REG_ENTRY("TIM15_CR2", TIM15->CR2),
    REG_ENTRY("TIM15_SMCR", TIM15->SMCR),
    REG_ENTRY("TIM15_DIER", TIM15->DIER),
    REG_ENTRY("TIM15_SR", TIM15->SR),
    REG_ENTRY("TIM15_EGR", TIM15->EGR),
    REG_ENTRY("TIM15_CCMR1", TIM15->CCMR1),
    REG_ENTRY("TIM15_CCMR2", TIM15->CCMR2),
    REG_ENTRY("TIM15_CCER", TIM15->CCER),
    REG_ENTRY("TIM15_CNT", TIM15->CNT),
    REG_ENTRY("TIM15_PSC", TIM15->PSC),
    REG_ENTRY("TIM15_ARR", TIM15->ARR),
    REG_ENTRY("TIM15_RCR", TIM15->RCR),
    REG_ENTRY("TIM15_CCR1", TIM15->CCR1),
    REG_ENTRY("TIM15_CCR2", TIM15->CCR2),
    REG_ENTRY("TIM15_CCR3", TIM15->CCR3),
    REG_ENTRY("TIM15_CCR4", TIM15->CCR4),
    REG_ENTRY("TIM15_BDTR", TIM15->BDTR),
    REG_ENTRY("TIM15_DCR", TIM15->DCR),
    REG_ENTRY("TIM15_DMAR", TIM15->DMAR),
    REG_ENTRY("TIM15_OR1", TIM15->OR1),
    REG_ENTRY("TIM15_CCMR3", TIM15->CCMR3),
    REG_ENTRY("TIM15_CCR5", TIM15->CCR5),
    REG_ENTRY("TIM15_CCR6", TIM15->CCR6),
    REG_ENTRY("TIM15_OR2", TIM15->OR2),
    REG_ENTRY("TIM15_OR3", TIM15->OR3),
    REG_ENTRY("TIM16_CR1", TIM16->CR1),
    REG_ENTRY("TIM16_CR2", TIM16->CR2),
    REG_ENTRY("TIM16_SMCR", TIM16->SMCR),
    REG_ENTRY("TIM16_DIER", TIM16->DIER),
    REG_ENTRY("TIM16_SR", TIM16->SR),
    REG_ENTRY("TIM16_EGR", TIM16->EGR),
    REG_ENTRY("TIM16_CCMR1", TIM16->CCMR1),
    REG_ENTRY("TIM16_CCMR2", TIM16->CCMR2),
    REG_ENTRY("TIM16_CCER", TIM16->CCER),
    REG_ENTRY("TIM16_CNT", TIM16->CNT),
    REG_ENTRY("TIM16_PSC", TIM16->PSC),
    REG_ENTRY("TIM16_ARR", TIM16->ARR),
    REG_ENTRY("TIM16_RCR", TIM16->RCR),
    REG_ENTRY("TIM16_CCR1", TIM16->CCR1),
    REG_ENTRY("TIM16_CCR2", TIM16->CCR2),
    REG_ENTRY("TIM16_CCR3", TIM16->CCR3),
    REG_ENTRY("TIM16_CCR4", TIM16->CCR4),
    REG_ENTRY("TIM16_BDTR", TIM16->BDTR),
    REG_ENTRY("TIM16_DCR", TIM16->DCR),
    REG_ENTRY("TIM16_DMAR", TIM16->DMAR),
    REG_ENTRY("TIM16_OR1", TIM16->OR1),
    REG_ENTRY("TIM16_CCMR3", TIM16->CCMR3),
    REG_ENTRY("TIM16_CCR5", TIM16->CCR5),
    REG_ENTRY("TIM16_CCR6", TIM16->CCR6),
    REG_ENTRY("TIM16_OR2", TIM16->OR2),
    REG_ENTRY("TIM16_OR3", TIM16->OR3),
    REG_ENTRY("TIM17_CR1", TIM17->CR1),
    REG_ENTRY("TIM17_CR2", TIM17->CR2),
    REG_ENTRY("TIM17_SMCR", TIM17->SMCR),
    REG_ENTRY("TIM17_DIER", TIM17->DIER),
    REG_ENTRY("TIM17_SR", TIM17->SR),
    REG_ENTRY("TIM17_EGR", TIM17->EGR),
    REG_ENTRY("TIM17_CCMR1", TIM17->CCMR1),
    REG_ENTRY("TIM17_CCMR2", TIM17->CCMR2),
    REG_ENTRY("TIM17_CCER", TIM17->CCER),
    REG_ENTRY("TIM17_CNT", TIM17->CNT),
    REG_ENTRY("TIM17_PSC", TIM17->PSC),
    REG_ENTRY("TIM17_ARR", TIM17->ARR),
    REG_ENTRY("TIM17_RCR", TIM17->RCR),
    REG_ENTRY("TIM17_CCR1", TIM17->CCR1),
    REG_ENTRY("TIM17_CCR2", TIM17->CCR2),
    REG_ENTRY("TIM17_CCR3", TIM17->CCR3),
    REG_ENTRY("TIM17_CCR4", TIM17->CCR4),
    REG_ENTRY("TIM17_BDTR", TIM17->BDTR),
    REG_ENTRY("TIM17_DCR", TIM17->DCR),
    REG_ENTRY("TIM17_DMAR", TIM17->DMAR),
    REG_ENTRY("TIM17_OR1", TIM17->OR1),
    REG_ENTRY("TIM17_CCMR3", TIM17->CCMR3),
    REG_ENTRY("TIM17_CCR5", TIM17->CCR5),
    REG_ENTRY("TIM17_CCR6", TIM17->CCR6),
    REG_ENTRY("TIM17_OR2", TIM17->OR2),
    REG_ENTRY("TIM17_OR3", TIM17->OR3),

