Zakrzewiaczek/stm32-asm-interpreter/Drivers/Registers/Src/stm32l476xx_registers.c
    // TSC registers
    REG_ENTRY("TSC_CR", TSC->CR),
    REG_ENTRY("TSC_IER", TSC->IER),
    REG_ENTRY("TSC_ICR", TSC->ICR),
    REG_ENTRY("TSC_ISR", TSC->ISR),
    REG_ENTRY("TSC_IOHCR", TSC->IOHCR),
    REG_ENTRY("TSC_IOASCR", TSC->IOASCR),
    REG_ENTRY("TSC_IOSCR", TSC->IOSCR),
    REG_ENTRY("TSC_IOCCR", TSC->IOCCR),
    REG_ENTRY("TSC_IOGCSR", TSC->IOGCSR),
    REG_ENTRY("TSC_IOGXCR", TSC->IOGXCR),

    // USART registers
    REG_ENTRY("USART2_CR1", USART2->CR1),
    REG_ENTRY("USART2_CR2", USART2->CR2),
    REG_ENTRY("USART2_CR3", USART2->CR3),
    REG_ENTRY("USART2_BRR", USART2->BRR),
    REG_ENTRY("USART2_GTPR", USART2->GTPR),
    REG_ENTRY("USART2_RTOR", USART2->RTOR),
    REG_ENTRY("USART2_RQR", USART2->RQR),
    REG_ENTRY("USART2_ISR", USART2->ISR),
    REG_ENTRY("USART2_ICR", USART2->ICR),
    REG_ENTRY("USART2_RDR", USART2->RDR),
    REG_ENTRY("USART2_TDR", USART2->TDR),
    REG_ENTRY("USART3_CR1", USART3->CR1),
    REG_ENTRY("USART3_CR2", USART3->CR2),
    REG_ENTRY("USART3_CR3", USART3->CR3),
    REG_ENTRY("USART3_BRR", USART3->BRR),
    REG_ENTRY("USART3_GTPR", USART3->GTPR),
    REG_ENTRY("USART3_RTOR", USART3->RTOR),
    REG_ENTRY("USART3_RQR", USART3->RQR),
    REG_ENTRY("USART3_ISR", USART3->ISR),
    REG_ENTRY("USART3_ICR", USART3->ICR),
    REG_ENTRY("USART3_RDR", USART3->RDR),
    REG_ENTRY("USART3_TDR", USART3->TDR),
    REG_ENTRY("UART4_CR1", UART4->CR1),
    REG_ENTRY("UART4_CR2", UART4->CR2),
    REG_ENTRY("UART4_CR3", UART4->CR3),
    REG_ENTRY("UART4_BRR", UART4->BRR),
    REG_ENTRY("UART4_GTPR", UART4->GTPR),
    REG_ENTRY("UART4_RTOR", UART4->RTOR),
    REG_ENTRY("UART4_RQR", UART4->RQR),
    REG_ENTRY("UART4_ISR", UART4->ISR),
    REG_ENTRY("UART4_ICR", UART4->ICR),
    REG_ENTRY("UART4_RDR", UART4->RDR),
    REG_ENTRY("UART4_TDR", UART4->TDR),
    REG_ENTRY("UART5_CR1", UART5->CR1),
    REG_ENTRY("UART5_CR2", UART5->CR2),
    REG_ENTRY("UART5_CR3", UART5->CR3),
    REG_ENTRY("UART5_BRR", UART5->BRR),
    REG_ENTRY("UART5_GTPR", UART5->GTPR),
    REG_ENTRY("UART5_RTOR", UART5->RTOR),
    REG_ENTRY("UART5_RQR", UART5->RQR),
    REG_ENTRY("UART5_ISR", UART5->ISR),
    REG_ENTRY("UART5_ICR", UART5->ICR),
    REG_ENTRY("UART5_RDR", UART5->RDR),
    REG_ENTRY("UART5_TDR", UART5->TDR),
    REG_ENTRY("LPUART1_CR1", LPUART1->CR1),
    REG_ENTRY("LPUART1_CR2", LPUART1->CR2),
    REG_ENTRY("LPUART1_CR3", LPUART1->CR3),
    REG_ENTRY("LPUART1_BRR", LPUART1->BRR),
    REG_ENTRY("LPUART1_GTPR", LPUART1->GTPR),
    REG_ENTRY("LPUART1_RTOR", LPUART1->RTOR),
    REG_ENTRY("LPUART1_RQR", LPUART1->RQR),
    REG_ENTRY("LPUART1_ISR", LPUART1->ISR),
    REG_ENTRY("LPUART1_ICR", LPUART1->ICR),
    REG_ENTRY("LPUART1_RDR", LPUART1->RDR),
    REG_ENTRY("LPUART1_TDR", LPUART1->TDR),
    REG_ENTRY("USART1_CR1", USART1->CR1),
    REG_ENTRY("USART1_CR2", USART1->CR2),
    REG_ENTRY("USART1_CR3", USART1->CR3),
    REG_ENTRY("USART1_BRR", USART1->BRR),
    REG_ENTRY("USART1_GTPR", USART1->GTPR),
    REG_ENTRY("USART1_RTOR", USART1->RTOR),
    REG_ENTRY("USART1_RQR", USART1->RQR),
    REG_ENTRY("USART1_ISR", USART1->ISR),
    REG_ENTRY("USART1_ICR", USART1->ICR),
    REG_ENTRY("USART1_RDR", USART1->RDR),
    REG_ENTRY("USART1_TDR", USART1->TDR),

    // VREFBUF registers
    REG_ENTRY("VREFBUF_CSR", VREFBUF->CSR),
    REG_ENTRY("VREFBUF_CCR", VREFBUF->CCR),

    // WWDG registers
    REG_ENTRY("WWDG_CR", WWDG->CR),
    REG_ENTRY("WWDG_CFR", WWDG->CFR),
    REG_ENTRY("WWDG_SR", WWDG->SR),

    // RNG registers
    REG_ENTRY("RNG_CR", RNG->CR),
    REG_ENTRY("RNG_SR", RNG->SR),
    REG_ENTRY("RNG_DR", RNG->DR),
};